organizations.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-09-12 Tue 18:22 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>organizations | alex bellon</title>
<meta name="author" content="Alex Bellon" />
<meta name="generator" content="Org Mode" />
<link href='https://fonts.googleapis.com/css?family=Nunito' rel='stylesheet'>
<link rel='stylesheet' type='text/css' href='assets/css/main.css'>
<link rel='icon' type='image/png' href='./images/personal_logo.png'>
<meta name='viewport' content='width=device-width, initial-scale=.5'>
<meta charset='utf-8'/>
<base target='_blank'/>
</head>
<body>
<div id="preamble" class="status">
<ul class='header'>
    <li><a target='_parent' href='.'>home</a></li>
    <li><a target='_parent' href='./publications.html'>publications</a></li>
    <li><a target='_parent' href='./projects.html'>projects</a></li>
    <li><a target='_parent' href='./experience.html'>experience</a></li>
    <li><a target='_parent' href='./organizations.html'>organizations</a></li>
    <li><a target='_parent' href='./talks.html'>talks</a></li>
    <li><a target='_parent' href='./art.html'>art</a></li>
    <li><a target='_parent' href='./photography.html'>photography</a></li>
</ul>
</div>
<div id="content" class="content">
<div id="organization" class="main">
<div class="contentBlock">

<div id="outline-container-org3d77d37" class="outline-2">
<h2 id="org3d77d37"><a href="http://cse-gsa.eng.ucsd.edu/grad-student-lounge/chezbob">chez bob</a></h2>
<div class="outline-text-2" id="text-org3d77d37">
<p>
I help Chez Bob, the graduate student food and drink co-op for the CSE department. Chez Bob is run out of the CSE graduate student lounge, and provides students, postdocs, faculty and staff with cheap snacks and caffeine 24/7. The infrastructure for Chez Bob is completely <a href="https://github.com/chezbob/chezbob">open source</a>!
</p>
</div>
</div>

<div id="outline-container-orgd8b6c7f" class="outline-2">
<h2 id="orgd8b6c7f"><a href="https://www.naqt.com/stats/school/index.jsp?org_id=66397">quizbowl</a></h2>
<div class="outline-text-2" id="text-orgd8b6c7f">
<p>
I am a member of UCSD&rsquo;s QuizBowl team. QuizBowl is like competitive trivia, with an emphasis on art and literature, history and science. I&rsquo;ve competed at ACF Fall 2022 (SoCal Region), NAQT Sectionals 2023 (SoCal Region), and ACRONYM 2023 (online).
</p>

<p class="divider">
<b>undergrad</b>
</p>
</div>
</div>

<div id="outline-container-org88bac28" class="outline-2">
<h2 id="org88bac28"><a href="https://isss.io">hash association of security hackers</a></h2>
<div class="outline-text-2" id="text-org88bac28">
<p>
I was a member of HASH (the HASH Association of Security Hackers), which was the overarching organization for competitive security at UT Austin. We competed in the <a href="https://www.nationalccdc.org/">Collegiate Cybersecurity Defense Competition (CCDC)</a> and the <a href="https://cp.tc/">Collegiate Penetration Testing Competition (CPTC)</a>. I served as captain of both the CCDC (2020, 2021) and CPTC (2019, 2020) teams. In CPTC, we placed 2nd at the <a href="https://cp.tc/new-england">New England Regionals</a> in 2019. In CCDC, we placed 2nd in 2019 and 3rd in 2020 at the <a href="https://southwestccdc.com/about/">Southwest Regional</a>; in 2021 we won the Southwest Regional and competed at Nationals for the first time in school history!
</p>
</div>
</div>

<div id="outline-container-org51fd69f" class="outline-2">
<h2 id="org51fd69f"><a href="https://www.isss.io/">information &amp; systems security society</a></h2>
<div class="outline-text-2" id="text-org51fd69f">
<p>
I was President of the Information &amp; System Security Society, a club dedicated to cybersecurity, from spring 2020 to spring 2021. Before that, I served as an engineering officer for 2 years. I wrote problems and challenges for the CTFs we held every two weeks, and gave talks about introductory security topics. I managed an officer team of 15, and we had 100+ members. We also held a yearly international CTF called UTCTF that had 1200+ competitors from all over the globe (I lead this project in 2020 and 2021).
</p>
</div>
</div>

<div id="outline-container-orge6009c2" class="outline-2">
<h2 id="orge6009c2"><a href="https://texasacm.org/">association for computing machinery</a></h2>
<div class="outline-text-2" id="text-orge6009c2">
<p>
For 2 years, I served as a Web/Tech office for UT&rsquo;s Association for Computing Machinery (ACM) chapter. I kept the <a href="https://texasacm.org">TexasACM.org</a> website up to date and free of bugs, responded to issues on our GitHub page, and maintained the GitHub Wiki. I also created, wrote curriculum for and hosted a series of <a href="https://github.com/UTACM/CS101">introductory workshops</a> for new CS majors to introduce them to topics like Linux, Git/VCS, debugging, and more.
</p>
</div>
</div>

<div id="outline-container-orgfa87ec4" class="outline-2">
<h2 id="orgfa87ec4"><a href="https://waitlisters.org">waitlisters</a></h2>
<div class="outline-text-2" id="text-orgfa87ec4">
<p>
I was one of the co-founders of a hackathon team called &rsquo;The Waitlisters&rsquo;. Started at HackTX 2017, we particpated in dozens of hackathons across the US. We finished in the top 3 at multiple competitions, and we even took home the grand prize at TAMUhack 2019. Besides Hackathons, we also particpated in CTFs and Programming Competitions.
</p>
</div>
</div>

<div id="outline-container-org57aa756" class="outline-2">
<h2 id="org57aa756"><a href="https://www.facebook.com/hookemarts/">hook &rsquo;em arts</a></h2>
<div class="outline-text-2" id="text-org57aa756">
<p>
I was a member of the Hook &rsquo;Em Arts club at UT, a student organization dedicated to promoting and enjoying performing arts. We hosted Loft Events for shows that come through the Bass Concert Hall, and volunteered at youth performances. We also spread awareness of student shows and performances on campus.
</p>
</div>
</div>

<div id="outline-container-orgc1d5f69" class="outline-2">
<h2 id="orgc1d5f69"><a href="https://www.facebook.com/TexasQuidditch/">austin quidditch</a></h2>
<div class="outline-text-2" id="text-orgc1d5f69">
<p>
For 2 years, I played on one of UT&rsquo;s club Quidditch teams, and yes, I mean the sport from Harry Potter. It&rsquo;s a co-ed, full contact sport played against other colleges and universities in the US Quidditch League. If you&rsquo;re wondering, I was primarily a Chaser and occasionally played Seeker.
</p>

</div></div>
</div>
</div>
</div>
<div id="postamble" class="status">
<div class='footer'>
    <ul class='header' style='margin-top:0px; margin-bottom:0px;'>
        <li><a target='_parent' href='./cv.pdf'>cv</a></li>
        <li><a target='_parent' href='https://github.com/alex-bellon'>github</a></li>
    </ul>
</div
</div>
</body>
</html>
